package by.belhard.java18.homeworks.homework8.task5;
/*

////Сделал немного спустя рукова.


Написать класс Человек, у которого есть поле "питомец".
Питомцы бывают 3х видов: Котик, Собачка и Рыбка.
Каждый питомец умеет играть, но делают они это по-разному.
Котик мяукает, Собака лает и прыгает, Рыбка плавает по кругу.
Описать у человека метод, который позволяет играть со своим питомцем, и метод, который позволяет играть с любым питомцем.
 */
public class Main {
    public static void main(String[] args) {

    }
}
